# pandas

pandas는 데이터처리를 위한 툴로 

* 외부 데이터 읽고 쓰기

* 정리된 데이터를 새로운 파일에 저장하기

* 데이터 시각화

를 할 수가 있다

___
# DataFrame

* column : 세로줄, 각 데이터의 특징을 담는다

* row : 가로줄, 각 column에 대한 정보들이 담겨져 있다

#### 그렇다면 판다스 데이터프레임만의 특징이 무엇이냐?

1. 데이터를 인덱스가 아닌 그 이름으로 찾을 수가 있다

2. 각 row에 들어가는 자료형이 꼭 동일하지 않아도 된다

___
# 판다스 실제 사용

In [1]:
import pandas as pd

In [3]:
test_list = [["호랑이", 10, 99], ["고양이", 66, 2], ["코뿔소", 82, 64]]
panda = pd.DataFrame(test_list)
print(panda)
panda

     0   1   2
0  호랑이  10  99
1  고양이  66   2
2  코뿔소  82  64

     0   1   2
0  호랑이  10  99
1  고양이  66   2
2  코뿔소  82  64

array랑 굉장히 비슷하구나 파이썬 리스트를 파라미터로 받는 것도 그렇고

그리고 dataframe을 대소문자를 구분해서 써야하는 것 같다?

출력하면 굉장히 예쁘게 나온다 너무 좋다

In [8]:
test_list1 = [["호랑이", 10, 99], ["고양이", 66, 2], ["코뿔소", 82, 64]]
panda = pd.DataFrame(test_list1, columns = ["이름", "나이", "공격력"], index = ["a", "b", "c"])
panda

    이름  나이  공격력
a  호랑이  10   99
b  고양이  66    2
c  코뿔소  82   64

이제 각 column과 row에 이름을 붙여줄 수가 있다

이름을 붙여주기 위해서는 리스트를 명명할 때 작업하는게 아니라 DataFrame을 만들때 작업한다

row는 파이썬에서 index라고 부른다

column은 같은 자료형만 들어가야 한다

row는 다른 자료형이 다 들어갈 수가 있다

___
# 실습 설명

아래와 같은 결과가 나오도록 DataFrame을 만들고 출력해 보세요.  

column은 name, birthday, occupation 총 3개입니다.

0. Taylor Swift	December 13, 1989	Singer-songwriter
1. Aaron Sorkin	June 9, 1961	Screenwriter
2. Harry Potter	July 31, 1980	Wizard
3. Ji-Sung Park	February 25, 1981	Footballer

In [9]:
import pandas as pd

stars_list = [["Taylor Swift", "December 13, 1989", "Singer-songwriter"], ["Aaron Sorkin", "June 9, 1961", "Screenwriter"], ["Harry Potter", "July 31, 1980", "Wizard"], ["Ji-Sung Park", "February 25, 1981", "Footballer"]]

stars_pandas = pd.DataFrame(stars_list, columns = ["name", "birthday", "occupation"])

stars_pandas

           name           birthday         occupation
0   Tayor Swift  December 13, 1989  Singer-songwriter
1  Aaron Sorkin       June 9, 1961       Screenwriter
2  Harry Potter      July 31, 1980             Wizard
3  Ji-Sung Park  February 25, 1981         Footballer

아 이게 파이썬 리스트로 해서 너무 길고 복잡하게 보이는 건가?

다른 형태(ex. 사전)으로도 해봐야겠다...

나중에

In [11]:
import pandas as pd

stars_list = [
    ["Taylor Swift", "December 13, 1989", "Singer-songwriter"], 
    ["Aaron Sorkin", "June 9, 1961", "Screenwriter"], 
    ["Harry Potter", "July 31, 1980", "Wizard"], 
    ["Ji-Sung Park", "February 25, 1981", "Footballer"]
]

이렇게 정렬해서 적을 수가 있다 훨씬 더 보기가 좋다